# CS105 Final Project

In [72]:
import pandas as pd
import numpy as np

Read Data In.

In [73]:
df = pd.read_csv('jeopardy.csv')
df.head(25)

,Show Number,Air Date,Round,Category,Value,Question,Answer
0,4680,2004-12-31,Jeopardy!,HISTORY,$200,"For the last 8 years of his life, Galileo was ...",Copernicus
1,4680,2004-12-31,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,$200,No. 2: 1912 Olympian; football star at Carlisl...,Jim Thorpe
2,4680,2004-12-31,Jeopardy!,EVERYBODY TALKS ABOUT IT...,$200,The city of Yuma in this state has a record av...,Arizona
3,4680,2004-12-31,Jeopardy!,THE COMPANY LINE,$200,"In 1963, live on ""The Art Linkletter Show"", th...",McDonald's
4,4680,2004-12-31,Jeopardy!,EPITAPHS & TRIBUTES,$200,"Signer of the Dec. of Indep., framer of the Co...",John Adams
5,4680,2004-12-31,Jeopardy!,3-LETTER WORDS,$200,"In the title of an Aesop fable, this insect sh...",the ant
6,4680,2004-12-31,Jeopardy!,HISTORY,$400,Built in 312 B.C. to link Rome & the South of ...,the Appian Way
7,4680,2004-12-31,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,$400,"No. 8: 30 steals for the Birmingham Barons; 2,...",Michael Jordan
8,4680,2004-12-31,Jeopardy!,EVERYBODY TALKS ABOUT IT...,$400,"In the winter of 1971-72, a record 1,122 inche...",Washington
9,4680,2004-12-31,Jeopardy!,THE COMPANY LINE,$400,This housewares store was named for the packag...,Crate & Barrel
10,4680,2004-12-31,Jeopardy!,EPITAPHS & TRIBUTES,$400,"""And away we go""",Jackie Gleason
11,4680,2004-12-31,Jeopardy!,3-LETTER WORDS,$400,Cows regurgitate this from the first stomach t...,the cud
12,4680,2004-12-31,Jeopardy!,HISTORY,$600,In 1000 Rajaraja I of the Cholas battled to ta...,Ceylon (or Sri Lanka)
13,4680,2004-12-31,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,$600,"No. 1: Lettered in hoops, football & lacrosse ...",Jim Brown
14,4680,2004-12-31,Jeopardy!,EVERYBODY TALKS ABOUT IT...,$600,"On June 28, 1994 the nat'l weather service beg...",the UV index
15,4680,2004-12-31,Jeopardy!,THE COMPANY LINE,$600,"This company's Accutron watch, introduced in 1...",Bulova
16,4680,2004-12-31,Jeopardy!,EPITAPHS & TRIBUTES,$600,"Outlaw: ""Murdered by a traitor and a coward wh...",Jesse James
17,4680,2004-12-31,Jeopardy!,3-LETTER WORDS,$600,"A small demon, or a mischievous child (who mig...",imp
18,4680,2004-12-31,Jeopardy!,HISTORY,$800,Karl led the first of these Marxist organizati...,the International
19,4680,2004-12-31,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,$800,No. 10: FB/LB for Columbia U. in the 1920s; MV...,(Lou) Gehrig
20,4680,2004-12-31,Jeopardy!,EVERYBODY TALKS ABOUT IT...,$800,Africa's lowest temperature was 11 degrees bel...,Morocco
21,4680,2004-12-31,Jeopardy!,THE COMPANY LINE,$800,Edward Teller & this man partnered in 1898 to ...,(Paul) Bonwit
22,4680,2004-12-31,Jeopardy!,EPITAPHS & TRIBUTES,"$2,000","1939 Oscar winner: ""...you are a credit to you...",Hattie McDaniel (for her role in Gone with the...
23,4680,2004-12-31,Jeopardy!,3-LETTER WORDS,$800,"In geologic time one of these, shorter than an...",era
24,4680,2004-12-31,Jeopardy!,HISTORY,$1000,This Asian political party was founded in 1885...,the Congress Party

Specify subsets, here we're only going to look at these specific values.

In [74]:
df = df[['Round', 'Value', 'Question', 'Answer']]
df.head(5)

,Round,Value,Question,Answer
0,Jeopardy!,$200,"For the last 8 years of his life, Galileo was ...",Copernicus
1,Jeopardy!,$200,No. 2: 1912 Olympian; football star at Carlisl...,Jim Thorpe
2,Jeopardy!,$200,The city of Yuma in this state has a record av...,Arizona
3,Jeopardy!,$200,"In 1963, live on ""The Art Linkletter Show"", th...",McDonald's
4,Jeopardy!,$200,"Signer of the Dec. of Indep., framer of the Co...",John Adams

Clean Data to remove Instances of Final Jeopary and 'None' Values, as they do not factor into our calculations.

In [75]:
df = df[~df.Round.str.contains('Final')]
df = df[~df.Value.str.contains('None')]

Create new columns for both `Words in Question` and `Words in Answer` by spliting strings in cells by the amount of spaces.  This creates a list with all words in a cell, then counting the size of that list with the `len()` function gives us the amount of words in each cell.

In [76]:
df['Words in Question'] = df['Question'].str.split().str.len()
df['Words in Answer'] = df['Answer'].str.split().str.len()

Notice that Value is currently being treated as categorical variable. Clean up this column and cast them to a float because we'll need to perform mathematical operations on these columns.

In [77]:
df['Value'] = df['Value'].str.replace('$','').str.replace(',', '').astype(float)
df

C:\Users\chai\AppData\Local\Temp\ipykernel_30368\2060277076.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['Value'] = df['Value'].str.replace('$','').str.replace(',', '').astype(float)

,Round,Value,Question,Answer,Words in Question,Words in Answer
0,Jeopardy!,200.0,"For the last 8 years of his life, Galileo was ...",Copernicus,18,1.0
1,Jeopardy!,200.0,No. 2: 1912 Olympian; football star at Carlisl...,Jim Thorpe,19,2.0
2,Jeopardy!,200.0,The city of Yuma in this state has a record av...,Arizona,18,1.0
3,Jeopardy!,200.0,"In 1963, live on ""The Art Linkletter Show"", th...",McDonald's,14,1.0
4,Jeopardy!,200.0,"Signer of the Dec. of Indep., framer of the Co...",John Adams,18,2.0
...,...,...,...,...,...,...
216924,Double Jeopardy!,2000.0,In 2006 the cast of this long-running hit emba...,Stomp,22,1.0
216925,Double Jeopardy!,2000.0,This Puccini opera turns on the solution to 3 ...,Turandot,14,1.0
216926,Double Jeopardy!,2000.0,In North America this term is properly applied...,a titmouse,18,2.0
216927,Double Jeopardy!,2000.0,"In Penny Lane, where this ""Hellraiser"" grew up...",Clive Barker,16,2.0
216928,Double Jeopardy!,2000.0,"From Ft. Sill, Okla. he made the plea, Arizona...",Geronimo,24,1.0